"""
练习 36 设计和调试
课后作后作业
写一个和上节练习类似的游戏，同类的任何题材的游戏都可以。你可以花一个星期时间让它尽可
能有趣一些。作为附加练习，你可以尽量多使用列表、函数、以及模组（还记得习题 13
吗？），而且尽量多写一些新的 Python 代码让你的游戏跑起来。
在写代码之前，你应该先把游戏的设计图画出来，包括玩家会碰到的房间、怪物、以及陷阱等环 节。
一旦你搞定了地图，就可以开始写代码了。如果你发现地图有问题，就调整一下地图，让代码和 地图互相符合。
写软件最好的方式是把它分解成很多小任务来完成：
1. 在一张纸或者索引卡片上，写上要完成这个软件你需要做的任务列表，这就是你的
待办事项。
2. 从任务列表上找到对你来说最容易的一个任务。
3. 在你的源文件上用注释的方式写下你要用代码实现它的思路指南。
4. 在你的注释下面写代码。
5. 写完就执行脚本看看你的写的代码能否正常运行。
6. 坚持这样的过程：写代码、运行测试、修改代码，知道它能正常运行。
7. 完成后给这项任务打勾，然后找下一个最容易的任务，重复上述步骤。 这个过程能够帮助你以一种系统化和连贯的方式来写软件。在工作的过程中，通过移除不必要的
任务以及添加新任务来更新你的任务列表。
"""